{"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "input1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 3], "dtype": "float32", "sparse": false, "name": "input1"}, "inbound_nodes": []}, {"name": "lstm_25", "class_name": "LSTM", "config": {"name": "lstm_25", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["input1", 0, 0, {}]]]}, {"name": "dropout_21", "class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_25", 0, 0, {}]]]}, {"name": "lstm_27", "class_name": "LSTM", "config": {"name": "lstm_27", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"name": "SelfAttention1", "class_name": "SeqSelfAttention", "config": {"name": "SelfAttention1", "trainable": true, "dtype": "float32", "units": 32, "attention_width": 4, "attention_type": "multiplicative", "return_attention": false, "history_only": true, "use_additive_bias": true, "use_attention_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "attention_activation": "sigmoid", "attention_regularizer_weight": 0.0}, "inbound_nodes": [[["lstm_27", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQAZACFAmQCZgIZAFMAKQNO6QEAAADp/////6kA\nKQHaAXRyAwAAAHIDAAAA+h88aXB5dGhvbi1pbnB1dC0zNy0yM2Q1NTljODUzZDI+2gg8bGFtYmRh\nPioAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lstm_27", 0, 0, {}]]]}, {"name": "global_max_pooling1d_10", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["SelfAttention1", 0, 0, {}]]]}, {"name": "concatenate_10", "class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lambda_10", 0, 0, {}], ["global_max_pooling1d_10", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 4000, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}], "input_layers": [["input1", 0, 0]], "output_layers": [["dense_11", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}